In [2]:
import pandas as pd
import numpy as np

In [3]:
pd

In [4]:
s1 = pd.Series(data={
    'name':'xiaobai',
    'age': 16
})
s1

name    xiaobai
age          16
dtype: object

In [6]:
df1 = pd.DataFrame(['a', 'b', 'c', 'd'])
df1

   0
0  a
1  b
2  c
3  d

   0
0  a
1  s
2  d
3  f

In [10]:
arr = np.random.randint(0, 100, (4, 4))
df2 = pd.DataFrame(arr)
df2

    0   1   2   3
0  28  39  52  56
1   6  99  65  27
2  61  94  15   6
3  10  20  96  51

In [12]:
dic = {
    'name':['小张', '小王', '小白'],
    'age':[12, 23, 18],
    'country':'China'
}
df = pd.DataFrame(dic)
df

  name  age country
0   小张   12   China
1   小王   23   China
2   小白   18   China

In [15]:
arr = np.random.randint(0, 100, (3, 4))
date = pd.date_range('20190722', periods=3)
df2 = pd.DataFrame(arr, 
                   index = date,
                   columns=list('abcd'))
df2

             a   b   c   d
2019-07-22  47  23  89  88
2019-07-23  18  93  16  38
2019-07-24  20  56  16  12

In [45]:
dic = {
    'name':['xiaowang', 'xiaobai', '大白'],
    'age': [12, 14, 16],
    'genger': ['man', 'weman', 'man']
}
df = pd.DataFrame(dic)

In [46]:
df

       name  age genger
0  xiaowang   12    man
1   xiaobai   14  weman
2        大白   16    man

In [47]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [48]:
df.columns

Index(['name', 'age', 'genger'], dtype='object')

In [49]:
df.dtypes

name      object
age        int64
genger    object
dtype: object

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
name      3 non-null object
age       3 non-null int64
genger    3 non-null object
dtypes: int64(1), object(2)
memory usage: 152.0+ bytes

In [52]:
df

       name  age genger
0  xiaowang   12    man
1   xiaobai   14  weman
2        大白   16    man

In [55]:
s = pd.Series(range(5), index=list('asdfg'))
s

a    0
s    1
d    2
f    3
g    4
dtype: int64

In [57]:
# 按索引取单个数据
s['d']

2

In [63]:
s[0]

0

In [66]:
# 按索引切片,左闭右闭
s['a':'d']

a    0
s    1
d    2
dtype: int64

In [67]:
# 按下标切片，左闭右开
s[0:2]

a    0
s    1
dtype: int64

In [69]:
s[['a', 'd']]

a    0
d    2
dtype: int64

In [70]:
s[[0, 2]]

a    0
d    2
dtype: int64

In [71]:
s

a    0
s    1
d    2
f    3
g    4
dtype: int64

In [72]:
s[s>1]

d    2
f    3
g    4
dtype: int64

In [75]:
s[(s>1)&(s<4)]

d    2
f    3
dtype: int64

In [76]:
s[s!=2]

a    0
s    1
f    3
g    4
dtype: int64

In [78]:
s[~(s==2)]

a    0
s    1
f    3
g    4
dtype: int64

In [80]:
s[(s<1)|(s>3)]

a    0
g    4
dtype: int64

In [83]:
s

a    0
s    1
d    2
f    3
g    4
dtype: int64

In [59]:
s2 = pd.Series(range(5), index=range(1, 6))
s2

1    0
2    1
3    2
4    3
5    4
dtype: int64

In [62]:
s2[1]

0

In [89]:
arr = np.random.randint(0, 100, (3, 4))
df = pd.DataFrame(arr,index=list('ABC'),
                   columns=list('abcd'))
df

    a   b   c   d
A  97  70  15  64
B   4  65  47  74
C  25  46  38  15

In [90]:
df['a']

A    97
B     4
C    25
Name: a, dtype: int32

In [91]:
df['a'].values

array([97,  4, 25])

In [92]:
df['a']['A']

97

In [93]:
df['a'][0]

97

In [94]:
df[['a', 'c']]

    a   c
A  97  15
B   4  47
C  25  38

In [101]:
df['a': 'c']

Empty DataFrame
Columns: [a, b, c, d]
Index: []

In [103]:
df

    a   b   c   d
A  97  70  15  64
B   4  65  47  74
C  25  46  38  15

In [104]:
df.loc[:, 'a': 'c']

    a   b   c
A  97  70  15
B   4  65  47
C  25  46  38

In [106]:
df.iloc[:, 0:2]

    a   b
A  97  70
B   4  65
C  25  46

In [111]:
df['A':'A']

    a   b   c   d
A  97  70  15  64

In [112]:
df['A':'C']

    a   b   c   d
A  97  70  15  64
B   4  65  47  74
C  25  46  38  15

In [121]:
df.loc[['A','C'],:]

    a   b   c   d
A  97  70  15  64
C  25  46  38  15

In [125]:
df.iloc[[2,0],:]

    a   b   c   d
C  25  46  38  15
A  97  70  15  64

In [126]:
s

a    0
s    1
d    2
f    3
g    4
dtype: int64

In [127]:
s.loc['a':'d']

a    0
s    1
d    2
dtype: int64

In [128]:
s.loc[['a','d']]

a    0
d    2
dtype: int64

In [129]:
df

    a   b   c   d
A  97  70  15  64
B   4  65  47  74
C  25  46  38  15

In [132]:
df.loc['A']

a    97
b    70
c    15
d    64
Name: A, dtype: int32

In [133]:
df['a']

A    97
B     4
C    25
Name: a, dtype: int32

In [135]:
df.loc[:,'a']

A    97
B     4
C    25
Name: a, dtype: int32

In [136]:
df['A':'C']

    a   b   c   d
A  97  70  15  64
B   4  65  47  74
C  25  46  38  15

In [140]:
df.loc['A':'C']

    a   b   c   d
A  97  70  15  64
B   4  65  47  74
C  25  46  38  15

In [141]:
df.loc[:,'a':'c']

    a   b   c
A  97  70  15
B   4  65  47
C  25  46  38

In [142]:
df.loc['A':'B','a':'c']

    a   b   c
A  97  70  15
B   4  65  47

In [143]:
df.loc[['A','C'],'a':'c']

    a   b   c
A  97  70  15
C  25  46  38

In [144]:
df

    a   b   c   d
A  97  70  15  64
B   4  65  47  74
C  25  46  38  15

In [145]:
df.iloc[0,0]

97

In [146]:
df[0:2]

    a   b   c   d
A  97  70  15  64
B   4  65  47  74

In [148]:
df.iloc[[0,2]]

    a   b   c   d
A  97  70  15  64
C  25  46  38  15

In [150]:
df.iloc[[0,2],1:3]

    b   c
A  70  15
C  46  38